app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at DESC
---
	def index
		@articles=Article.all

INSERT INTO "articles" ("title", "date", "description", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "可以放圖了嗎"], ["date", "20190121"], ["description", "這樣會怎樣"], ["body", "<p>這樣哩</p>\r\n"], ["created_at", "2019-01-21 13:01:15.673755"], ["updated_at", "2019-01-21 13:01:15.673755"]]
---
	def create
		article=Article.new articles_params
		article.save

UPDATE "articles" SET "feature" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["feature", "螢幕快照_2019-01-20_下午11.55.35.png"], ["updated_at", "2019-01-22 14:37:48.396845"], ["id", 8]]
---
	def update

		@article.update articles_params

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def set_article
		@article=Article.find params[:id]